ZhuangTao123/nRF52-Beacon-Firmware/examples/ble_peripheral/ble_app_template_user/main.c
#if defined(USE_UICR_FOR_MAJ_MIN_VALUES)
#define MAJ_VAL_OFFSET_IN_BEACON_INFO   18                                      /**< Position of the MSB of the Major Value in m_beacon_info array. */
#define UICR_ADDRESS                    0x10001080                              /**< Address of the UICR register used by this example. The major and minor versions to be encoded into the advertising data will be picked up from this location. */
#endif

#define TX_POWER_LEVEL					-4
#define DEAD_BEEF                       0xDEADBEEF                              /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

/* Declare all services structure your application is using
 * BLE_XYZ_DEF(m_xyz);
 */
NRF_BLE_GATT_DEF(m_gatt);                                                       /**< GATT module instance. */
BLE_ADVERTISING_DEF(m_advertising);                                             /**< Advertising module instance. */
BLE_BCS_DEF(m_bcs);																/**< Beacon Service instance. */
BLE_TPS_DEF(m_tps);																/**< Tx Power Service instance. */

// Global variables in the application
static uint16_t m_conn_handle 		= BLE_CONN_HANDLE_INVALID;                  /**< Handle of the current connection. */
static int8_t	tx_power			= TX_POWER_LEVEL;							/**< Tx Power passed to the program. */
static uint16_t	app_adv_interval 	= APP_ADV_FAST_INTERVAL;					/**< Advertising interval passed to the program. */
static bool 	app_adv_param_update = false;
static bool		app_tx_power_param_update = false;
static bool		app_flash_update_state = false;

// YOUR_JOB: Use UUIDs for service(s) used in your application.
static ble_uuid_t m_adv_uuids[] =                                               /**< Universally unique service identifiers. */
{
    //{BLE_UUID_TX_POWER_SERVICE, BLE_UUID_TYPE_BLE},
    {BLE_UUID_BCS_SERVICE, BLE_UUID_TYPE_VENDOR_BEGIN}
};

static uint8_t m_beacon_info[APP_BEACON_INFO_LENGTH] =                          /**< Information advertised by the Beacon. */
{
    APP_DEVICE_TYPE,     // Manufacturer specific information. Specifies the device type in this
                         // implementation.
    APP_ADV_DATA_LENGTH, // Manufacturer specific information. Specifies the length of the
                         // manufacturer specific data in this implementation.
    APP_BEACON_UUID,     // 128 bit UUID value.
    APP_MAJOR_VALUE,     // Major arbitrary value that can be used to distinguish between Beacons.
    APP_MINOR_VALUE,     // Minor arbitrary value that can be used to distinguish between Beacons.
    APP_MEASURED_RSSI    // Manufacturer specific information. The Beacon's measured TX power in
                         // this implementation.
};

beacon_conf_flash_t	beacon_conf = 
{
	.uuid_major_minor = {APP_BEACON_UUID, APP_MAJOR_VALUE, APP_MINOR_VALUE},
	.rssi_ref_stored = APP_MEASURED_RSSI,
	.tx_power_stored = TX_POWER_LEVEL,
	.advertising_interval_stored = APP_ADV_FAST_INTERVAL
};

static void advertising_init(void);
static void advertising_start(bool erase_bonds);


/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num   Line number of the failing ASSERT call.
 * @param[in] file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for loading user configuration of major and minor value
 *
 * @param[in] void	none input argument
 */
static void load_uicr_configuration(void)
{
#if defined(USE_UICR_FOR_MAJ_MIN_VALUES)
	// If USE_UICR_FOR_MAJ_MIN_VALUES is defined, the major and minor values will be read from the
	// UICR instead of using the default values. The major and minor values obtained from the UICR
	// are encoded into advertising data in big endian order (MSB First).
	// To set the UICR used by this example to a desired value, write to the address 0x10001080
	// using the nrfjprog tool. The command to be used is as follows.
	// nrfjprog --snr <Segger-chip-Serial-Number> --memwr 0x10001080 --val <your major/minor value>
	// For example, for a major value and minor value of 0xabcd and 0x0102 respectively, the
	// the following command should be used.
	// nrfjprog --snr <Segger-chip-Serial-Number> --memwr 0x10001080 --val 0xabcd0102
	uint16_t major_value = ((*(uint32_t *)UICR_ADDRESS) & 0xFFFF0000) >> 16;
	uint16_t minor_value = ((*(uint32_t *)UICR_ADDRESS) & 0x0000FFFF);

	uint8_t index = MAJ_VAL_OFFSET_IN_BEACON_INFO;

	m_beacon_info[index++] = MSB_16(major_value);
	m_beacon_info[index++] = LSB_16(major_value);

	m_beacon_info[index++] = MSB_16(minor_value);
	m_beacon_info[index++] = LSB_16(minor_value);
#endif
}

/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    ret_code_t err_code;

    switch (p_evt->evt_id)
    {
        case PM_EVT_BONDED_PEER_CONNECTED:
        {
            NRF_LOG_INFO("Connected to a previously bonded device.");
        } break;

        case PM_EVT_CONN_SEC_SUCCEEDED:
        {
            NRF_LOG_INFO("Connection secured: role: %d, conn_handle: 0x%x, procedure: %d.",
                         ble_conn_state_role(p_evt->conn_handle),
                         p_evt->conn_handle,
                         p_evt->params.conn_sec_succeeded.procedure);
        } break;

        case PM_EVT_CONN_SEC_FAILED:
        {
            /* Often, when securing fails, it shouldn't be restarted, for security reasons.
             * Other times, it can be restarted directly.
             * Sometimes it can be restarted, but only after changing some Security Parameters.
             * Sometimes, it cannot be restarted until the link is disconnected and reconnected.
             * Sometimes it is impossible, to secure the link, or the peer device does not support it.
             * How to handle this error is highly application dependent. */
        } break;

        case PM_EVT_CONN_SEC_CONFIG_REQ:
        {
            // Reject pairing request from an already bonded peer.
            pm_conn_sec_config_t conn_sec_config = {.allow_repairing = false};
            pm_conn_sec_config_reply(p_evt->conn_handle, &conn_sec_config);
        } break;

