ZhuangTao123/nRF52-Beacon-Firmware/examples/ble_peripheral/ble_app_template_user/main.c
        case PM_EVT_STORAGE_FULL:
        {
            // Run garbage collection on the flash.
            err_code = fds_gc();
            if (err_code == FDS_ERR_BUSY || err_code == FDS_ERR_NO_SPACE_IN_QUEUES)
            {
                // Retry.
            }
            else
            {
                APP_ERROR_CHECK(err_code);
            }
        } break;

        case PM_EVT_PEERS_DELETE_SUCCEEDED:
        {
            advertising_start(false);
        } break;

        case PM_EVT_LOCAL_DB_CACHE_APPLY_FAILED:
        {
            // The local database has likely changed, send service changed indications.
            pm_local_database_has_changed();
        } break;

        case PM_EVT_PEER_DATA_UPDATE_FAILED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.peer_data_update_failed.error);
        } break;

        case PM_EVT_PEER_DELETE_FAILED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.peer_delete_failed.error);
        } break;

        case PM_EVT_PEERS_DELETE_FAILED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.peers_delete_failed_evt.error);
        } break;

        case PM_EVT_ERROR_UNEXPECTED:
        {
            // Assert.
            APP_ERROR_CHECK(p_evt->params.error_unexpected.error);
        } break;

        case PM_EVT_CONN_SEC_START:
        case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
        case PM_EVT_PEER_DELETE_SUCCEEDED:
        case PM_EVT_LOCAL_DB_CACHE_APPLIED:
        case PM_EVT_SERVICE_CHANGED_IND_SENT:
        case PM_EVT_SERVICE_CHANGED_IND_CONFIRMED:
        default:
            break;
    }
}


/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application timers.
 */
static void timers_init(void)
{
    // Initialize timer module.
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    // Create timers.

    /* YOUR_JOB: Create any timers to be used by the application.
                 Below is an example of how to create a timer.
                 For every new timer needed, increase the value of the macro APP_TIMER_MAX_TIMERS by
                 one.
       ret_code_t err_code;
       err_code = app_timer_create(&m_app_timer_id, APP_TIMER_MODE_REPEATED, timer_timeout_handler);
       APP_ERROR_CHECK(err_code); */
}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    /* YOUR_JOB: Use an appearance value matching the application's use case.
       err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_);
       APP_ERROR_CHECK(err_code); */

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);

	tx_power = beacon_conf.tx_power_stored;
	err_code = sd_ble_gap_tx_power_set(tx_power);
	APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the data from the Beacon Service.
 *
 * @details This function will process the data received from the Beacon BLE Service
 *
 * @param[in] p_evt    Beacon Service event structure.
 */
/**@snippet [Handling the data received over BLE] */
static void bcs_data_handler(ble_bcs_evt_t * p_evt)
{
	uint8_t   * p_data = NULL;
	uint16_t 	data_len = p_evt->params.rx_data.length;

    if (p_evt->type == BLE_BCS_EVT_ADV_RX_DATA && data_len == 21)
    {
    	p_data = (uint8_t *)p_evt->params.rx_data.p_data;
    	memcpy(&m_beacon_info[2], p_data, 21);
		memcpy(&beacon_conf.uuid_major_minor, p_data, 21);
		app_adv_param_update = true;
		app_flash_update_state = true;
    }
	else if(p_evt->type == BLE_BCS_EVT_ADVINT_RX_DATA && data_len == sizeof(uint16_t))
	{
		p_data = (uint8_t *)p_evt->params.rx_data.p_data;
		app_adv_interval = (uint16_t)(*(p_data+1) << 8) + *p_data;
		beacon_conf.advertising_interval_stored = app_adv_interval;
		app_adv_param_update = true;
		app_flash_update_state = true;
	}
	else
	{
		app_adv_param_update = false;
		// Nothing to do here.
	}
	p_data = NULL;

}

static void tps_data_handler(ble_tps_evt_t * p_evt)
{
	uint8_t * p_data = NULL;
	uint8_t   data_len = p_evt->params.rx_data.length;

	if(p_evt->evt_type == BLE_TPS_EVT_POWER_CHANGE && data_len == 1)
	{
		p_data = (uint8_t *)p_evt->params.rx_data.p_data;
		tx_power = (int8_t)*p_data;
		beacon_conf.tx_power_stored = tx_power;
		app_tx_power_param_update = true;
		app_flash_update_state = true;
	}
	else
	{
		app_tx_power_param_update = false;
		// Do nothing here.
	}
	p_data = NULL;
}

/**@snippet [Handling the data received over BLE] */


/**@brief Function for handling the YYY Service events.
 * YOUR_JOB implement a service handler function depending on the event the service you are using can generate
 *
 * @details This function will be called for all YY Service events which are passed to
 *          the application.
 *
 * @param[in]   p_yy_service   YY Service structure.
 * @param[in]   p_evt          Event received from the YY Service.
 *
 *
static void on_yys_evt(ble_yy_service_t     * p_yy_service,
                       ble_yy_service_evt_t * p_evt)
{
    switch (p_evt->evt_type)
    {
        case BLE_YY_NAME_EVT_WRITE:
            APPL_LOG("[APPL]: charact written with value %s. ", p_evt->params.char_xx.value.p_str);
            break;

        default:
            // No implementation needed.
            break;
    }
}
*/

/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
	ret_code_t			err_code;
	ble_bcs_init_t		bcs_init;
	ble_tps_init_t		tps_init;

